
set_db timing_analysis_type ocv
routeDesign -globalDetail
route_opt_design -opt
optDesign -postRoute 

