xrun(64): 23.09-s013: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s013: Started on Dec 18, 2024 at 16:09:18 -03
xrun
	-f file_list.f
		-smartorder
		-work work
		-top tb_mult_serial
		-notimingchecks
		-gui
		-access +rw
		../rtl/mult_serial.sv
		../tb/mult_tb.sv
	-input wave.tcl
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /tools/cadence/XCELIUM2309/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	23.09-s013
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f file_list.f -input wave.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
xmsim: *E,NOEVTC: VITAL timing checks not available: -notimingchecks was used during elaboration.
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> 
xcelium> simvision -input wave.tcl.svcf
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm tb_mult_serial.clk tb_mult_serial.end_mul tb_mult_serial.expected_prod tb_mult_serial.produto tb_mult_serial.rand_A tb_mult_serial.rand_B tb_mult_serial.reset tb_mult_serial.start tb_mult_serial.dut.cont
Created probe 1
xcelium> run 200 ns
Ran until 200 NS + 0
xcelium> run 10000 ns
All  tests executed
Simulation complete via $finish(1) at time 8802 NS + 0
../tb/mult_tb.sv:64         $finish;
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	23.09-s013: Exiting on Dec 18, 2024 at 16:12:02 -03  (total: 00:02:44)
