xrun(64): 23.09-s013: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s013: Started on Dec 17, 2024 at 16:34:00 -03
xrun
	-f sim_local.f
		-smartorder
		-work work
		-define USE_NETLIST
		-top nanoCPU_TB
		-gui
		-access +rw
		-maxdelays
		-sdf_cmd_file ./sdf.cmd
		/tools/pdk/cadence/gpdk045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_all_v4.4/gsclib045_lvt/verilog/fast_vdd1v0_basicCells_lvt.v
		../synt/NanoCPU_logic_mapped.v
		../tb/nanoTB.sv
	-input wave.tcl
Recompiling... reason: file '../synt/NanoCPU_logic_mapped.sdf' is newer than expected.
	expected: Tue Dec 17 16:18:33 2024
	actual:   Tue Dec 17 16:33:30 2024
file: ../synt/NanoCPU_logic_mapped.v
	module work.Reg16bit_113:v
		errors: 0, warnings: 0
	module work.NanoCPU:v
		errors: 0, warnings: 0
file: ../tb/nanoTB.sv
	module work.nanoCPU_TB:sv
		errors: 0, warnings: 0
	Elaborating the design hierarchy:
		Caching library 'work' ....... Done
	Top level design units:
		nanoCPU_TB
	Reading SDF file from location "../synt/NanoCPU_logic_mapped.sdf"
	Compiled SDF file "NanoCPU_logic_mapped.sdf.X" older than source SDF file "../synt/NanoCPU_logic_mapped.sdf".
	Recompiling.
	Writing compiled SDF file to "NanoCPU_logic_mapped.sdf.X".
	Annotating SDF timing data:
		Compiled SDF file:     NanoCPU_logic_mapped.sdf.X
		Log file:              ./sdf.log
		Backannotation scope:  nanoCPU_TB:CPU
		Configuration file:    
		MTM control:           MAXIMUM
		Scale factors:         1:1:1
		Scale type:            FROM_MAXIMUM
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 42>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[10]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 60>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[9]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 78>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[8]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 96>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[7]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 114>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[6]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 132>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[11]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 150>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 168>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[12]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 186>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[4]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 204>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[5]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 222>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[13]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 240>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[15]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 258>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_IR.\Q_reg[14]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 276>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 320>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[7]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 338>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 356>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[2]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 374>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[5]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 392>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[4]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 410>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[3]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 428>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.R_PC.\Q_reg[6]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 446>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[4]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 500>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 518>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[2]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 536>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[3]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 554>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 572>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[11]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 590>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[5]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 608>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[6]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 626>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[12]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 644>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[8]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 662>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[9]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 680>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[10]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 698>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[7]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 716>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[13]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 734>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[14]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 752>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r0.\Q_reg[15]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 770>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[4]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 814>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 832>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[2]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 850>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[3]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 868>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 886>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[11]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 904>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[5]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 922>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[6]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 940>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[12]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 958>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[8]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 976>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[9]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 994>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[10]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1012>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[7]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1030>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[13]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1048>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[14]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1066>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r1.\Q_reg[15]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1084>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[4]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1128>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1146>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[2]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1164>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[3]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1182>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1200>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[11]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1218>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[5]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1236>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[6]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1254>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[12]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1272>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[8]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1290>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[9]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1308>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[10]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1326>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[7]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1344>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[13]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1362>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[14]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1380>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r2.\Q_reg[15]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1398>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[4]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1442>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1460>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[2]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1478>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[3]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1496>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1514>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[11]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1532>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[5]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1550>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[6]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1568>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[12]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1586>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[8]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1604>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[9]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1622>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[10]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1640>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[7]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1658>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[13]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1676>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[14]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1694>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.r3.\Q_reg[15]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 1712>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.\state_reg[0]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 5796>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-21) (23)) of instance nanoCPU_TB.CPU.\state_reg[1]  of module DFFRHQX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 5814>.
xmelab: *W,SDFNET: Unable to annotate to non-existent timing check (RECREM (posedge RN) (posedge CK) (-17) (23)) of instance nanoCPU_TB.CPU.\state_reg[2]  of module DFFRX1LVT <../synt/NanoCPU_logic_mapped.sdf, line 10258>.
	Annotation completed with 0 Errors and 89 Warnings
	SDF statistics: 
		 No. of Pathdelays = 2614    	 No. of Disabled Pathdelays = 0        Annotated = 100.00% (2614/2614) 
		 No. of Tchecks    = 659     	 No. of Disabled Tchecks    = 0        Annotated = 28.83% (190/659) 
				        Total(T) 	   Disabled(D) 	    Annotated(A)	  Percentage(A/(T-D))
		 Path Delays	          2614	             0	              2614	                100.00
		       $hold	            89	             0	                 0	                  0.00
		      $width	           279	             0	                 0	                  0.00
		   $recovery	            89	             0	                 0	                  0.00
		  $setuphold	           202	             0	               190	                 94.06
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		work.Reg16bit_113:v <0x41c257e7>
			streams:   1, words:   139
		work.NanoCPU:v <0x76150448>
			streams:   1, words:   185
		work.nanoCPU_TB:sv <0x718539c9>
			streams:  13, words:  5776
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                    Instances  Unique
		Modules:                  726      54
		UDPs:                     184       3
		Primitives:              2085       5
		Timing outputs:           789      16
		Registers:                103      14
		Scalar wires:            1010       -
		Expanded wires:            40       3
		Vectored wires:             1       -
		Always blocks:              2       2
		Initial blocks:             2       2
		Cont. assignments:          2       2
		Pseudo assignments:        13       -
		Timing checks:            861      54
		Interconnect:            1985       -
		Delayed tcheck signals:   196      60
		Simulation timescale:     1ps
	Writing initial simulation snapshot: work.nanoCPU_TB:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /tools/cadence/XCELIUM2309/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	23.09-s013
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f sim_local.f -input wave.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -vcd -into dump.fst _dump.fst1 -timescale fs
Created VCD database _dump.fst1
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> database -open -vcd -into verilog.dump _verilog.dump1 -timescale fs
Created VCD database _verilog.dump1
xcelium> probe -create -database waves nanoCPU_TB.ck nanoCPU_TB.rst nanoCPU_TB.we nanoCPU_TB.CPU.r0.Q nanoCPU_TB.CPU.r1.Q nanoCPU_TB.CPU.r2.Q nanoCPU_TB.CPU.r3.Q nanoCPU_TB.memory[20] nanoCPU_TB.memory[21] nanoCPU_TB.memory[22] nanoCPU_TB.CPU.state
Created probe 1
xcelium> probe -create -database waves nanoCPU_TB.CPU.IR nanoCPU_TB.CPU.PC
Created probe 2
xcelium> probe -create -database waves nanoCPU_TB.CPU.r3.D
Created probe 3
xcelium> probe -create -database waves
xmsim: *E,PRWHAT: No items specified in probe -create command.
xcelium> 
xcelium> simvision -input wave.tcl.svcf
xcelium> probe -create -shm nanoCPU_TB.CPU.R_IR.Q[12] nanoCPU_TB.CPU.R_IR.Q[13] nanoCPU_TB.CPU.R_IR.Q[14] nanoCPU_TB.CPU.R_IR.Q[15]
Created probe 4
xcelium> run 900 ns
xmsim: *W,DFUSE: $dumpfile dump.fst is already in use (VCD file).
            File: ../tb/nanoTB.sv, line = 42, pos = 16
           Scope: nanoCPU_TB
            Time: 0 FS + 0

xmsim: *W,VCDFUSE: Default VCD file name verilog.dump already in use (VCD file).
            Time: 0 FS + 6

Ran until 900 NS + 0
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	23.09-s013: Exiting on Dec 17, 2024 at 17:08:13 -03  (total: 00:34:13)
